-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: MySQL-8.2
-- Время создания: Май 11 2025 г., 15:06
-- Версия сервера: 8.2.0
-- Версия PHP: 8.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `site`
--

-- --------------------------------------------------------

--
-- Структура таблицы `students`
--

CREATE TABLE `students` (
  `stud_id` int NOT NULL,
  `gp` int DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `surname` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `patronymic` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `students`
--

INSERT INTO `students` (`stud_id`, `gp`, `name`, `surname`, `patronymic`) VALUES
(20, 1, 'Иван', 'Иванов', 'Иванович'),
(21, 2, 'Петр', 'Петров', 'Петрович'),
(22, 1, 'Сидор', 'Сидоров', 'Сидорович'),
(23, 3, 'Анна', 'Смирнова', 'Сергеевна'),
(24, 2, 'Дмитрий', 'Кузнецов', 'Алексеевич'),
(25, 1, 'Елена', 'Соколова', 'Васильевна'),
(26, 4, 'Александр', 'Попов', 'Михайлович'),
(27, 3, 'Ольга', 'Лебедева', 'Ивановна'),
(28, 2, 'Сергей', 'Новиков', 'Викторович'),
(29, 1, 'Мария', 'Морозова', 'Павловна'),
(30, 3, 'Андрей', 'Волков', 'Дмитриевич'),
(31, 4, 'Татьяна', 'Белова', 'Александровна'),
(32, 2, 'Максим', 'Козлов', 'Игоревич'),
(33, 1, 'Наталья', 'Орлова', 'Андреевна'),
(34, 3, 'Денис', 'Михайлов', 'Сергеевич'),
(35, 4, 'Юлия', 'Федорова', 'Владимировна'),
(36, 2, 'Кирилл', 'Егоров', 'Алексеевич'),
(37, 1, 'Светлана', 'Николаева', 'Михайловна'),
(38, 3, 'Роман', 'Андреев', 'Иванович'),
(39, 4, 'Виктория', 'Павлова', 'Дмитриевна'),
(40, 2, 'Артем', 'Степанов', 'Сергеевич'),
(41, 1, 'Анастасия', 'Григорьева', 'Андреевна'),
(42, 3, 'Илья', 'Яковлев', 'Михайлович'),
(43, 4, 'Дарья', 'Семенова', 'Витальевна'),
(44, 2, 'Владислав', 'Борисов', 'Алексеевич'),
(45, 1, 'Алина', 'Зайцева', 'Игоревна'),
(46, 3, 'Никита', 'Тимофеев', 'Дмитриевич'),
(47, 4, 'Кристина', 'Белозерова', 'Павловна'),
(48, 2, 'Егор', 'Герасимов', 'Романович'),
(49, 1, 'Валерия', 'Кузьмина', 'Александровна'),
(50, 3, 'Артур', 'Данилов', 'Олегович'),
(51, 4, 'Полина', 'Жукова', 'Максимовна'),
(52, 2, 'Станислав', 'Ефимов', 'Андреевич'),
(53, 1, 'Александра', 'Крюкова', 'Сергеевна'),
(54, 3, 'Арсений', 'Логинов', 'Ильич'),
(56, 2, 'Дмитрий', 'Нестеров', 'Андреевич'),
(57, 1, 'Елизавета', 'Овчинникова', 'Алексеевна'),
(58, 3, 'Глеб', 'Родионов', 'Евгеньевич'),
(59, 4, 'Вероника', 'Соловьева', 'Дмитриевна'),
(60, 2, 'Виктор', 'Тарасов', 'Артемович'),
(61, 1, 'Ксения', 'Уварова', 'Павловна'),
(62, 3, 'Максим', 'Фомин', 'Александрович'),
(63, 4, 'Маргарита', 'Харитонова', 'Игоревна'),
(64, 2, 'Денис', 'Чернов', 'Станиславович'),
(65, 1, 'Ангелина', 'Шарова', 'Владимировна'),
(66, 3, 'Иван', 'Щербаков', 'Олегович'),
(67, 4, 'София', 'Якушева', 'Дмитриевна'),
(68, 2, 'Павел', 'Алексеев', 'Кириллович'),
(69, 1, 'Анастасия', 'Быкова', 'Вадимовна'),
(70, 4, 'Армян', 'Армянов', 'Армянович');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`stud_id`),
  ADD KEY `gp` (`gp`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `students`
--
ALTER TABLE `students`
  MODIFY `stud_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `students`
--
ALTER TABLE `students`
  ADD CONSTRAINT `students_ibfk_1` FOREIGN KEY (`gp`) REFERENCES `groups` (`group_id`) ON DELETE RESTRICT ON UPDATE RESTRICT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
